module.exports = {
  up(queryInterface, DataTypes) {
    return queryInterface.createTable("period", {
      id: {
        type: DataTypes.INTEGER,
        allowNull: false,
        autoIncrement: true,
        primaryKey: true
      },

      title: {
        type: DataTypes.STRING(200),
        allowNull: false
      },

      description: {
        type: DataTypes.TEXT,
        allowNull: false
      }
    }).then(
      function () {
        return queryInterface.bulkInsert(
          "period",
          [
            {
              "id": 1,
              "title": "Львівський університет у 1661–1773 рр.",
              "description": "Історія одного з найвідоміших українських університетів сягає витоками періоду XVI–XVII ст., коли розвиток книгодрукування та початкового і середнього шкільництва дозволив дієво втілити модель “семи вільних наук” у навчальних осередках, які стали конкурентними у боротьбі за вищий статус. Це були школа Львівського православного Свято-Успенського ставропігійського братства, школа, яка діяла при латинському кафедральному соборі та школа єзуїтського колегіуму. Вчителі та вихованці львівської братської школи у першій половині XVII ст. склали основу духовно-інтелектуального середовища у Києві, стали апологетами релігійно-національного відродження, втіленого у реформах митрополита Петра (Могили), ідеологами заснування Києво-Могилянської академії. Серед них – брати Зизанії; ректор Іван Борецький (згодом – митрополит Іов); засновник лаврської друкарні архімандрит Єлисей (Плетенецький), архімандрит Захарія (Копистенський), ігумен Йосиф (Кирилович), перекладач Гавриїл Дорофеєвич та багато інших. Ідею створення єзуїтського вищого навчального закладу у Львові вперше озвучив на зібранні провінційної конґреґації один із останніх князів Олельковичів Слуцьких Ян Сємон 1593 р. Восени 1608 р. відбулося проголошення статусу колегіуму та урочисте відкриття при ньому школи, де троє професорів викладали риторику і поетику, для духовних осіб двоє викладачів читали моральну теологію і один – полемічну. Свою діяльність колегіум починав із двома сотнями учнів, через рік їх чисельність зросла до 400, а в 1613 р. складала вже 530. У 1611 р. були відкриті окремі класи риторики та логіки. З 1612 р. введено окремий курс філософії, а з наступного року (як другий рік філософії) почалося викладання математики. Джерела дозволяють припустити, що вже бл. 1614 р. викладали “руську” мову. З 1633 р. тут читали курс схоластичної теології. Таким чином, міська кафедральна школа, що зберігала за собою право навчати дітей міщан, була змушена “поступитись” шляхетською молоддю на користь колегіуму. Зростання кількості учнів зумовлювало і необхідність розбудови приміщень. 1615 р. було закладено друкарню, що систематично діяла з 1642 р., а окремі шрифти з первісного обладнання використовувалися ще й у XVIII ст."
            }, {
              "id": 2,
              "title": "Університет Королівства Галичини та Лодомерії (1784–1918)",
              "description": "Active"
            }, {
              "id": 3,
              "title": "Львівський університет між світовими війнами (1919–1939)",
              "description": "Unconfirmed"
            }
          ]
        );
      }
    );
  },

  down(queryInterface) {
    return queryInterface.dropTable("period");
  }
};