module.exports = {
  up(queryInterface, DataTypes) {
    return queryInterface.createTable("event", {
      id: {
        type: DataTypes.INTEGER,
        allowNull: false,
        autoIncrement: true,
        primaryKey: true
      },

      period_id: {
        type: DataTypes.INTEGER,
        allowNull: false,
        references: {
          model: "period",
          key: "id"
        }
      },

      title: {
        type: DataTypes.STRING(200),
        allowNull: false
      },

      description: {
        type: DataTypes.TEXT,
        allowNull: false
      }
    }).then(
      function () {
        return queryInterface.bulkInsert(
          "event",
          [
            {
              "id": 1,
              "period_id": 1,
              "title": "Львівський університет у 1661–1773 рр.",
              "description": "Історія одного з найвідоміших українських університетів сягає витоками періоду XVI–XVII ст., коли розвиток книгодрукування та початкового і середнього шкільництва дозволив дієво втілити модель “семи вільних наук” у навчальних осередках, які стали конкурентними у боротьбі за вищий статус. Це були школа Львівського православного Свято-Успенського ставропігійського братства, школа, яка діяла при латинському кафедральному соборі та школа єзуїтського колегіуму. Вчителі та вихованці львівської братської школи у першій половині XVII ст. склали основу духовно-інтелектуального середовища у Києві, стали апологетами релігійно-національного відродження, втіленого у реформах митрополита Петра (Могили), ідеологами заснування Києво-Могилянської академії. Серед них – брати Зизанії; ректор Іван Борецький (згодом – митрополит Іов); засновник лаврської друкарні архімандрит Єлисей (Плетенецький), архімандрит Захарія (Копистенський), ігумен Йосиф (Кирилович), перекладач Гавриїл Дорофеєвич та багато інших. Ідею створення єзуїтського вищого навчального закладу у Львові вперше озвучив на зібранні провінційної конґреґації один із останніх князів Олельковичів Слуцьких Ян Сємон 1593 р. Восени 1608 р. відбулося проголошення статусу колегіуму та урочисте відкриття при ньому школи, де троє професорів викладали риторику і поетику, для духовних осіб двоє викладачів читали моральну теологію і один – полемічну. Свою діяльність колегіум починав із двома сотнями учнів, через рік їх чисельність зросла до 400, а в 1613 р. складала вже 530. У 1611 р. були відкриті окремі класи риторики та логіки. З 1612 р. введено окремий курс філософії, а з наступного року (як другий рік філософії) почалося викладання математики. Джерела дозволяють припустити, що вже бл. 1614 р. викладали “руську” мову. З 1633 р. тут читали курс схоластичної теології. Таким чином, міська кафедральна школа, що зберігала за собою право навчати дітей міщан, була змушена “поступитись” шляхетською молоддю на користь колегіуму. Зростання кількості учнів зумовлювало і необхідність розбудови приміщень. 1615 р. було закладено друкарню, що систематично діяла з 1642 р., а окремі шрифти з первісного обладнання використовувалися ще й у XVIII ст."
            }, {
              "id": 2,
              "period_id": 1,
              "title": "Під опікою церкви",
              "description": "Упродовж 1661- 1773 рр. Львівський університет перебував у підпорядкуванні ордену єзуїтів, які провадили активну освітню та видавничу діяльність."
            }, {
              "id": 3,
              "period_id": 1,
              "title": "Гадяцький трактат та що означав привілей Яна ІІ Каземіжа?",
              "description": "Безпосереднім приводом для реорганізації Львівської єзуїтської школи стало укладення у вересні 1658 р. Гадяцького трактату. У тексті угоди, запропонованої сеймові гетьманом Іваном Виговським, було обумовлено заснування двох українських академій-університетів. Загроза відкриття Університету у Львові, у якому було найкраще розвинуте українське православне шкільництво, причинило активну діяльність єзуїтів, які й домоглися у короля Яна ІІ Казімежа відповідного привілею 20 січня 1661 р.На підставі цієї угоди 20 січня 1661 р. король Ян II Казимир підписав привілей, яким надав школі при Львівській єзуїтській колегії, заснованій 1608 р., «гідність академії і титул університету» з правом викладання всіх тогочасних університетських дисцплін. статус академії передбачав можливість необмежено впроваджувати наукові ступені – “достойні маґістратуру, ліценціат і докторат”. У документі окремо наголошувалося на рівності прав нової академії Львівської з давніми Краківською та Віленською."
            }, {
              "id": 4,
              "period_id": 1,
              "title": "Цитата",
              "description": "Згідно з документом, школі було надано “гідність Академії і титул Університету” з правом встановлення “генеральних студій на кожному з дозволених факультетів, тобто, теології як схоластичної, так і моральної, філософії, математики і обох прав, медицини і вільних мистецтв”. Окрім того, Для реалізації привілею окрім папського благословення потрібним було його схвалення на сеймі, чого не сталося через антиєзуїтські настрої шляхти. Незважаючи на це та не декларуючи в офіційній документації незгоди з рішенням сейму керівники колегіуму реорганізували навчальний процес та привели його у відповідність з вимогами класичних єзуїтських академій."
            }, {
              "id": 5,
              "period_id": 1,
              "title": "Львівська академія затверджена",
              "description": "Незважаючи на протести Замойської та Краківської академій, Наступною нагодою утвердити академічний статус львівські єзуїти скористалися у середині XVIII ст. Оскільки рішення сейму уже не було обов’язковим, 18 квітня 1758 р. король Август ІІІ видав привілей, який підтверджував університетський рівень єзуїтського навчального закладу. Це був фактично новий ерекційний диплом. 24 березня 1759 р. папа Климентій ХІІІ окремою буллою “Cunctis ubique pateat” затвердив Львівську академію."
            }, {
              "id": 6,
              "period_id": 1,
              "title": "",
              "description": "\"Cunctis ubique pateat\""
            }, {
              "id": 7,
              "period_id": 1,
              "title": "",
              "description": "Очолював університет ректор, головне приміщення було на теперішній вулиці Театральній."
            }, {
              "id": 8,
              "period_id": 1,
              "title": "Вперше в історії: Філософський факультет, факультет теології та мов і вільних мистцетві.",
              "description": "З 1761 р. в Університеті запроваджено факультетську структуру, очолену деканами – відповідно трьох факультетів філософії, теології та мов і вільних мистецтв. 1771 р. було закладено власну університетську обсерваторію. Упродовж XVIII ст. навчальний заклад високо цінував свою академічну гідність, що знайшло відображення у паралельному вживанні в офіційних документах термінів “Universitas”, “Academia”, усталенні титулатури ректора – “Rector Universitatis et Collegii”. Університетський статус навчального закладу підкреслений і в провенієнційних записах на сторінках книг академічної бібліотеки."
            }, {
              "id": 9,
              "period_id": 1,
              "title": "Державтовторчий події. Перший поділ Речі Посполитої 1772",
              "description": "Після першого поділу Речі Посполитої у 1772 році галицькі землі відійшли до складу володінь австрійських Габсбургів і були включені до Королівства Галичини та Лодомерії з центром у Львові. Після скасування ордену єзуїтів (1773) закрито всі підпорядковані їм культурно-освітні інституції, у тім числі Львівський університет. "
            }, {
              "id": 10,
              "period_id": 1,
              "title": "",
              "description": "Після першого поділу Речі Посполитої у 1772 році галицькі землі відійшли до складу володінь австрійських Габсбургів і були включені до Королівства Галичини та Лодомерії з центром у Львові. Після скасування ордену єзуїтів (1773) закрито всі підпорядковані їм культурно-освітні інституції, у тім числі Львівський університет. Прагнення залучити більшу кількість студентів до навчального процесу та забезпечити відповідний рівень освіти, який би задовольняв потреби не лише духовних кіл, а відповідав інтелектуальним запитам політичних еліт, змушував єзуїтів шукати нові навчально-організаційні форми. На початку XVIII ст. при Львівському університеті був заснований конвікт, а 1749 р. почав діяти Шляхетський колегіум. Навчальні програми охоплювали курси латинської, польської, німецької, французької мов, військову і цивільну архітектуру, історію Польщі і всесвітню історію, математику, географію, хронологію, право, астрономію та ін. Якщо на той час, завдяки кафедральній школі, традиції вивчення німецької мови у Львові були вже тривалими, то після здійснених реформ та реорганізацій Львівський університет став також одним із головних осередків читання та поширення французької книги у Східній Європі. Заборона діяльності ордену у західноєвропейських країнах сприяла міграції до Львова вчених, які, як безпосередні носії живої мови, ефективно забезпечували навчальний процес. Загалом численні представники викладацького складу Львівського університету були відомими вченими у різних галузях науки: історик Каспер Нєсєцький, математики Фаустин Ґродзіцький, Войцех Бистжоновський, Томаш Сєкєжинський, філософи Каспер Дружбіцький, Станіслав Смялкович, Александр Лоренцович, Іґнацій Красіцький, Григорій Вінцентій Пірамович, теологи та риторики Ян Цвєкальський, Анджей Темберський, Себастьян Вєжхлейський, професор канонічного права Ян Казімеж Даровський та багато інших. Окрім представників польської шляхти, упродовж XVII-XVIII ст. в Університеті навчалося багато українців. Історик Іван Крип’якевич обґрунтував гіпотезу про навчання у львівській єзуїтській школі Богдана Хмельницького, не ідентифікуючи себе власним прізвищем, могли тут навчатися і представники інших родів дрібної та середньої української шляхти. Якщо у перші десятиліття діяльності школи такі випадки були поодинокими, і православні українці, навчаючись до певного класу, покидали навчання і продовжували студії чи кар’єру поза орденом та Католицькою церквою, то уже у XVIII ст. українці складали значну кількість студентів – до 30%, і це були переважно ченці-василіани."
            }, {
              "id": 11,
              "period_id": 1,
              "title": "Залишити приміщення Університету до заходу сонця…",
              "description": "21 липня 1773 р. під тиском низки європейських монарших дворів римський папа Климентій XIV своїм касаційним бреве “Dominus ac Redemtor Noster” припинив діяльність Товариства Ісуса та всіх освітніх установ, заснованих єзуїтами, і закликав членів ордену, викладацький склад, продовжити свою діяльність у Церкві. 28 вересня 1773 р. до Львівського університету прибув суфраган Самуель Ґловінський з австрійськими комісарами для оголошення бреве. Навчальний заклад припинив діяльність, а професори до заходу сонця мали залишити приміщення Університету і знайти помешкання у місті."
            }, {
              "id": 12,
              "period_id": 1,
              "title": "Студент-мандрівник Василь Григорович-Барський та француз П’єр Біда ",
              "description": "1723 р. студентом Львівського університету став вихованець Києво-Могилянської академії Василь Григорович-Барський, згодом – відомий мандрівник та письменник. Навчалися у Львівському університеті й студенти із Західної Європи. Так, наприклад, у 1764 р. повний курс теології завершив француз П’єр Франсуа Біда (1733 р. н.), який викладав у Сандомирі та Острозі, а згодом повернувся до Франції. Австрійський період історії Львова (остання третина XVIII – початок ХХ ст.) був віховим для подальшої історії Львівського університету. Закритий з ліквідацією ордену єзуїтів (1773), Університет був відновлений у 1784 р. австрійським імператором Йосифом ІІ."
            },
          ]
        );
      }
    );
  },

  down(queryInterface) {
    return queryInterface.dropTable("event");
  }
};