module.exports = {
  up(queryInterface, DataTypes) {
    return queryInterface.createTable("event", {
      id: {
        type: DataTypes.INTEGER,
        allowNull: false,
        autoIncrement: true,
        primaryKey: true
      },

      period_id: {
        type: DataTypes.INTEGER,
        allowNull: false,
        references: {
          model: "period",
          key: "id"
        }
      },

      title: {
        type: DataTypes.STRING(200),
        allowNull: false
      },

      description: {
        type: DataTypes.TEXT,
        allowNull: false
      }
    }).then(
      function () {
        return queryInterface.bulkInsert(
          "event",
          [
            {
              "id": 1,
              "period_id": 1,
              "title": "Львівський університет у 1661–1773 рр.",
              "description": "Історія одного з найвідоміших українських університетів сягає витоками періоду XVI–XVII ст., коли розвиток книгодрукування та початкового і середнього шкільництва дозволив дієво втілити модель “семи вільних наук” у навчальних осередках, які стали конкурентними у боротьбі за вищий статус. Це були школа Львівського православного Свято-Успенського ставропігійського братства, школа, яка діяла при латинському кафедральному соборі та школа єзуїтського колегіуму. Вчителі та вихованці львівської братської школи у першій половині XVII ст. склали основу духовно-інтелектуального середовища у Києві, стали апологетами релігійно-національного відродження, втіленого у реформах митрополита Петра (Могили), ідеологами заснування Києво-Могилянської академії. Серед них – брати Зизанії; ректор Іван Борецький (згодом – митрополит Іов); засновник лаврської друкарні архімандрит Єлисей (Плетенецький), архімандрит Захарія (Копистенський), ігумен Йосиф (Кирилович), перекладач Гавриїл Дорофеєвич та багато інших. Ідею створення єзуїтського вищого навчального закладу у Львові вперше озвучив на зібранні провінційної конґреґації один із останніх князів Олельковичів Слуцьких Ян Сємон 1593 р. Восени 1608 р. відбулося проголошення статусу колегіуму та урочисте відкриття при ньому школи, де троє професорів викладали риторику і поетику, для духовних осіб двоє викладачів читали моральну теологію і один – полемічну. Свою діяльність колегіум починав із двома сотнями учнів, через рік їх чисельність зросла до 400, а в 1613 р. складала вже 530. У 1611 р. були відкриті окремі класи риторики та логіки. З 1612 р. введено окремий курс філософії, а з наступного року (як другий рік філософії) почалося викладання математики. Джерела дозволяють припустити, що вже бл. 1614 р. викладали “руську” мову. З 1633 р. тут читали курс схоластичної теології. Таким чином, міська кафедральна школа, що зберігала за собою право навчати дітей міщан, була змушена “поступитись” шляхетською молоддю на користь колегіуму. Зростання кількості учнів зумовлювало і необхідність розбудови приміщень. 1615 р. було закладено друкарню, що систематично діяла з 1642 р., а окремі шрифти з первісного обладнання використовувалися ще й у XVIII ст."
            }, {
            "id": 2,
            "period_id": 1,
            "title": "Під опікою церкви",
            "description": "Упродовж 1661- 1773 рр. Львівський університет перебував у підпорядкуванні ордену єзуїтів, які провадили активну освітню та видавничу діяльність."
          }, {
            "id": 3,
            "period_id": 1,
            "title": "Гадяцький трактат та що означав привілей Яна ІІ Каземіжа?",
            "description": "Безпосереднім приводом для реорганізації Львівської єзуїтської школи стало укладення у вересні 1658 р. Гадяцького трактату. У тексті угоди, запропонованої сеймові гетьманом Іваном Виговським, було обумовлено заснування двох українських академій-університетів. Загроза відкриття Університету у Львові, у якому було найкраще розвинуте українське православне шкільництво, причинило активну діяльність єзуїтів, які й домоглися у короля Яна ІІ Казімежа відповідного привілею 20 січня 1661 р.На підставі цієї угоди 20 січня 1661 р. король Ян II Казимир підписав привілей, яким надав школі при Львівській єзуїтській колегії, заснованій 1608 р., «гідність академії і титул університету» з правом викладання всіх тогочасних університетських дисцплін. статус академії передбачав можливість необмежено впроваджувати наукові ступені – “достойні маґістратуру, ліценціат і докторат”. У документі окремо наголошувалося на рівності прав нової академії Львівської з давніми Краківською та Віленською."
          }, {
            "id": 4,
            "period_id": 1,
            "title": "Цитата",
            "description": "Згідно з документом, школі було надано “гідність Академії і титул Університету” з правом встановлення “генеральних студій на кожному з дозволених факультетів, тобто, теології як схоластичної, так і моральної, філософії, математики і обох прав, медицини і вільних мистецтв”. Окрім того, Для реалізації привілею окрім папського благословення потрібним було його схвалення на сеймі, чого не сталося через антиєзуїтські настрої шляхти. Незважаючи на це та не декларуючи в офіційній документації незгоди з рішенням сейму керівники колегіуму реорганізували навчальний процес та привели його у відповідність з вимогами класичних єзуїтських академій."
          }, {
            "id": 5,
            "period_id": 1,
            "title": "Львівська академія затверджена",
            "description": "Незважаючи на протести Замойської та Краківської академій, Наступною нагодою утвердити академічний статус львівські єзуїти скористалися у середині XVIII ст. Оскільки рішення сейму уже не було обов’язковим, 18 квітня 1758 р. король Август ІІІ видав привілей, який підтверджував університетський рівень єзуїтського навчального закладу. Це був фактично новий ерекційний диплом. 24 березня 1759 р. папа Климентій ХІІІ окремою буллою “Cunctis ubique pateat” затвердив Львівську академію."
          }, {
            "id": 6,
            "period_id": 1,
            "title": "",
            "description": "\"Cunctis ubique pateat\""
          }, {
            "id": 7,
            "period_id": 1,
            "title": "",
            "description": "Очолював університет ректор, головне приміщення було на теперішній вулиці Театральній."
          }, {
            "id": 8,
            "period_id": 1,
            "title": "Вперше в історії: Філософський факультет, факультет теології та мов і вільних мистцетві.",
            "description": "З 1761 р. в Університеті запроваджено факультетську структуру, очолену деканами – відповідно трьох факультетів філософії, теології та мов і вільних мистецтв. 1771 р. було закладено власну університетську обсерваторію. Упродовж XVIII ст. навчальний заклад високо цінував свою академічну гідність, що знайшло відображення у паралельному вживанні в офіційних документах термінів “Universitas”, “Academia”, усталенні титулатури ректора – “Rector Universitatis et Collegii”. Університетський статус навчального закладу підкреслений і в провенієнційних записах на сторінках книг академічної бібліотеки."
          }, {
            "id": 9,
            "period_id": 1,
            "title": "Державтовторчий події. Перший поділ Речі Посполитої 1772",
            "description": "Після першого поділу Речі Посполитої у 1772 році галицькі землі відійшли до складу володінь австрійських Габсбургів і були включені до Королівства Галичини та Лодомерії з центром у Львові. Після скасування ордену єзуїтів (1773) закрито всі підпорядковані їм культурно-освітні інституції, у тім числі Львівський університет. "
          }, {
            "id": 10,
            "period_id": 1,
            "title": "",
            "description": "Після першого поділу Речі Посполитої у 1772 році галицькі землі відійшли до складу володінь австрійських Габсбургів і були включені до Королівства Галичини та Лодомерії з центром у Львові. Після скасування ордену єзуїтів (1773) закрито всі підпорядковані їм культурно-освітні інституції, у тім числі Львівський університет. Прагнення залучити більшу кількість студентів до навчального процесу та забезпечити відповідний рівень освіти, який би задовольняв потреби не лише духовних кіл, а відповідав інтелектуальним запитам політичних еліт, змушував єзуїтів шукати нові навчально-організаційні форми. На початку XVIII ст. при Львівському університеті був заснований конвікт, а 1749 р. почав діяти Шляхетський колегіум. Навчальні програми охоплювали курси латинської, польської, німецької, французької мов, військову і цивільну архітектуру, історію Польщі і всесвітню історію, математику, географію, хронологію, право, астрономію та ін. Якщо на той час, завдяки кафедральній школі, традиції вивчення німецької мови у Львові були вже тривалими, то після здійснених реформ та реорганізацій Львівський університет став також одним із головних осередків читання та поширення французької книги у Східній Європі. Заборона діяльності ордену у західноєвропейських країнах сприяла міграції до Львова вчених, які, як безпосередні носії живої мови, ефективно забезпечували навчальний процес. Загалом численні представники викладацького складу Львівського університету були відомими вченими у різних галузях науки: історик Каспер Нєсєцький, математики Фаустин Ґродзіцький, Войцех Бистжоновський, Томаш Сєкєжинський, філософи Каспер Дружбіцький, Станіслав Смялкович, Александр Лоренцович, Іґнацій Красіцький, Григорій Вінцентій Пірамович, теологи та риторики Ян Цвєкальський, Анджей Темберський, Себастьян Вєжхлейський, професор канонічного права Ян Казімеж Даровський та багато інших. Окрім представників польської шляхти, упродовж XVII-XVIII ст. в Університеті навчалося багато українців. Історик Іван Крип’якевич обґрунтував гіпотезу про навчання у львівській єзуїтській школі Богдана Хмельницького, не ідентифікуючи себе власним прізвищем, могли тут навчатися і представники інших родів дрібної та середньої української шляхти. Якщо у перші десятиліття діяльності школи такі випадки були поодинокими, і православні українці, навчаючись до певного класу, покидали навчання і продовжували студії чи кар’єру поза орденом та Католицькою церквою, то уже у XVIII ст. українці складали значну кількість студентів – до 30%, і це були переважно ченці-василіани."
          }, {
            "id": 11,
            "period_id": 1,
            "title": "Залишити приміщення Університету до заходу сонця…",
            "description": "21 липня 1773 р. під тиском низки європейських монарших дворів римський папа Климентій XIV своїм касаційним бреве “Dominus ac Redemtor Noster” припинив діяльність Товариства Ісуса та всіх освітніх установ, заснованих єзуїтами, і закликав членів ордену, викладацький склад, продовжити свою діяльність у Церкві. 28 вересня 1773 р. до Львівського університету прибув суфраган Самуель Ґловінський з австрійськими комісарами для оголошення бреве. Навчальний заклад припинив діяльність, а професори до заходу сонця мали залишити приміщення Університету і знайти помешкання у місті."
          }, {
            "id": 12,
            "period_id": 1,
            "title": "Студент-мандрівник Василь Григорович-Барський та француз П’єр Біда ",
            "description": "1723 р. студентом Львівського університету став вихованець Києво-Могилянської академії Василь Григорович-Барський, згодом – відомий мандрівник та письменник. Навчалися у Львівському університеті й студенти із Західної Європи. Так, наприклад, у 1764 р. повний курс теології завершив француз П’єр Франсуа Біда (1733 р. н.), який викладав у Сандомирі та Острозі, а згодом повернувся до Франції. Австрійський період історії Львова (остання третина XVIII – початок ХХ ст.) був віховим для подальшої історії Львівського університету. Закритий з ліквідацією ордену єзуїтів (1773), Університет був відновлений у 1784 р. австрійським імператором Йосифом ІІ."
          }, {
            "id": 13,
            "period_id": 2,
            "title": "Університет відновлено: 21 жовтня 1784 Акт імператора Йосифа І",
            "description": ""
          }, {
            "id": 14,
            "period_id": 2,
            "title": "Постать",
            "description": "Першим ректором відновленого університету був Перемиський римо-каталицький єпископ Антоній Вацлав Бетанський. 184-1785 Йосиф ІІ передав його книгозбірні унікальну бібліотеку родини Гереллі, яка стала основою фонду наукової літератури."
          }, {
            "id": 15,
            "period_id": 2,
            "title": "Перші ректори",
            "description": "796-1797 – Антоній Ангелович, Галицький греко-католицький митрополит. За його ініціативи створено у 1787 окремий підрозділ «STUDIUM RUTHENUM», де навчання проводили укр мовою."
          }, {
            "id": 16,
            "period_id": 2,
            "title": "",
            "description": "Голова Головної Руської Ради (першої політичної організації в Галиччині) Григорій Яхимович (1860/61), член “Руської трійці” Яків Головацький (1863/64), римо-католицький святий Юзеф Більчевський (1900; беатифікацію Ю. Більчевського провів Папа Римський Іван Павло ІІ під час свого візиту до Львова в 2001 р.).\n" +
              "\n" +
              "Керував університетом академічний сенат (консисторія), до якого належали ректор (обирався на рік), декани факультетів та сеньйори (найстарші за віком і стажем професори). Ректор та декани мали інсигнії – скіпетри та медалі.\n"
          }, {
            "id": 17,
            "period_id": 2,
            "title": "",
            "description": "В австрійський період у Львівському університеті було чотири факультети: філософський (об’єднував кафедри, які спеціалізувалися з гуманітарних, природничих і технічних наук), теологічний, юридичний та медичний (існував у 1784–1805 рр., відновлений 1894 р.). Наприкінці XVIII – в першій половині ХІХ ст. усі університетські кафедри були в університетській будівлі на вул. Краківській (у 1848 р. знищена пожежею), з 1851 р. – у будівлі колишнього монастиря тринітаріїв на вул. св. Миколая (нині М. Грушевського). Наприкінці ХІХ – на початку ХХ ст. на вул. Длуґоша (нині Кирила і Мефодія) збудовано два корпуси для природничих і технічних кафедр філософського факультету, на вул. Пекарській – корпуси для відновленого медичного факультету, а на вул. Мохнацького (нині М. Драгоманова) – корпус для Наукової бібліотеки Львівського університету (проект розпису її читального залу виконав відомий художник Юліуш Макаревич)."
          }, {
            "id": 18,
            "period_id": 2,
            "title": "",
            "description": "ХІХ – початок ХХ ст. був періодом національного відродження бездержавних народів поліетнічних імперій, зокрема, монархії Габсбурґів. Вплив національного відродження українців та поляків Австрійської монархії на Львівський унгіверситет добре ілюструють діяльність гуртка “Руська трійця” (заснованого у 1830-х роках студентами-українцями Маркіяном Шашкевичем, Іваном Вагилевичем та Яковом Головацьким); львівське повстання під час “Весни народів” 1848–1849 рр., активну участь у якому взяло студентське збройне формування Академічний легіон; перетворення Львівського університету наприкінці 1860-х – на початку 1870-х років з німецькомовного навчального закладу на утраквістичний (двомовний) польсько-український; боротьба українців проти полонізації Львівського університету, найдраматичнішою подією якої стала загибель у 1910 р., під час польсько-української сутички, українського студента-правника Адама Коцка."
          }, {
            "id": 19,
            "period_id": 2,
            "title": "",
            "description": "Попри напруженість національно-політичної ситуації в Королівстві Галичини та Лодомерії, впродовж австрійського періоду своєї історії Львівський університет перетворився на потужний освітньо-науковий центр, який на початку ХХ ст. за кількістю студентів займав одне з перших місць серед університетів Австро-Угорщини.\n" +
              "Серед студентів Імператорсько-королівського університету імені імператора Франца І у Львові – видатні українські діячі, зокрема, автор музики державного гімну України Михайло Вербицький, режисер, засновник театру “Березіль” Лесь Курбас, адвокат і письменник Андрій Чайковський, учасниця стрілецького руху Олена Степанів, очільник Західноукраїнської Народної Республіки Євген Петрушевич, патріарх Української Греко-католицької Церкви Йосиф Сліпий та ін. З 1875 р. на філософському факультеті Львівського університету навчався Іван Франко – його майбутній патрон. У 1895 р. І. Франко успішно пройшов процедуру габілітації на доцента української літератури та етнографії. Проте, як закінчити Львівський університет, так й отримати у ньому посаду І. Франко, з політичних мотивів, не зміг. У 1916 р. І. Франка висунули на здобуття Нобелівської премії. Проте отримати її Каменяреві також не судилося."
          }, {
            "id": 20,
            "period_id": 2,
            "title": "",
            "description": "“Довге ХІХ століття” було періодом змін інтелектуальних парадигм: просвітництво (кінець XVIII – початок ХІХ ст.) – романтизм (перша половина ХІХ ст.) – позитивізм (з другої половини ХІХ ст.). Так, наприкінці XVIII – на початку ХІХ ст. викладачі Львівського університету були здебільшого просвітниками-енциклопедистами (запрошеними з різних теренів монархії Габсбурґів та з німецьких земель), які спеціалізувались у багатьох галузях знань. Наприклад, професор натуральної історії Бальтазар Акé (Гáкет) (1739/40–1815) – лікар, геолог, географ, ботанік, етнограф (іменем ученого названо рід Hacquetia і новий вид Pedicularis hacqueti). Або ж професор логіки, метафізики та моральної філософії, викладач Studium Ruthenum Львівського університету Петро Лодій (1764–1829), який був відомим філософом, математиком та правознавцем (переклав підручник К. Баумайстера “Elementa Philosophie” (“Наставленія Любомудрїя Нравоучительного”, Львів, 1790), що стало важливим вкладом у розвиток української філософської термінології). Натомість від середини ХІХ ст. серед викладачів університету почали переважати спеціалісти у вузьких галузях знань, з кожним роком серед них зростала частка випускників Львівського університету."
          }, {
            "id": 21,
            "period_id": 2,
            "title": "",
            "description": "“Довге ХІХ століття” було періодом змін інтелектуальних парадигм: просвітництво (кінець XVIII – початок ХІХ ст.) – романтизм (перша половина ХІХ ст.) – позитивізм (з другої половини ХІХ ст.). Так, наприкінці XVIII – на початку ХІХ ст. викладачі Львівського університету були здебільшого просвітниками-енциклопедистами (запрошеними з різних теренів монархії Габсбурґів та з німецьких земель), які спеціалізувались у багатьох галузях знань. Наприклад, професор натуральної історії Бальтазар Акé (Гáкет) (1739/40–1815) – лікар, геолог, географ, ботанік, етнограф (іменем ученого названо рід Hacquetia і новий вид Pedicularis hacqueti). Або ж професор логіки, метафізики та моральної філософії, викладач Studium Ruthenum Львівського університету Петро Лодій (1764–1829), який був відомим філософом, математиком та правознавцем (переклав підручник К. Баумайстера “Elementa Philosophie” (“Наставленія Любомудрїя Нравоучительного”, Львів, 1790), що стало важливим вкладом у розвиток української філософської термінології). Натомість від середини ХІХ ст. серед викладачів університету почали переважати спеціалісти у вузьких галузях знань, з кожним роком серед них зростала частка випускників Львівського університету."
          }, {
            "id": 22,
            "period_id": 2,
            "title": "",
            "description": "Упродовж 1908–1914 рр. у Львівському університеті розпочав свою науково-педагогічну діяльність його випускник Степан Рудницький (1877–1937) – один із засновників новітньої української географічної та картографічної наук. У працях з географії України С. Рудницький визначив максимальну (1056 тис. км2) та мінімальну (905 тис. км2) українську національну територію, створивши відповідні науково обґрунтовані карти."
          }, {
            "id": 23,
            "period_id": 2,
            "title": "",
            "description": "Професори Львівського університету зробили значний вклад у розвиток світової науки. Так, професор анатомії і фізіології Юліус Планнер (1827–1881) став першовідкривачем рідких кристалів (1861), випередивши в цьому ботаніка Фрідріха Рейнітцера та кристалофізика Отто Лемана. А професор теоретичної фізики Мар’ян Смолуховський (1872–1917) у 1898 р. розробив теорію стрибка температури біля твердої поверхні для розріджених газів. Праці вченого початку ХХ ст. з теорії флуктуацій та броунівського руху, поряд із працями Альберта Айнштайна, є одними з основних у цій галузі наукового знання. На основі теорії броунівського руху М. Смолуховський створив кінетичну теорію коагуляції колоїдів та теорію електрокінетичних явищ, заклавши підґрунтя кінетичної теорії колоїдних систем. Його праці завдали серйозного удару гіпотезі “теплової смерті Всесвіту”, підтвердили справедливість молекулярно-кінетичної теорії, сприяли остаточному зміцненню атомістичних уявлень."
          }, {
            "id": 24,
            "period_id": 2,
            "title": "",
            "description": "В австрійський період закладено основи колекцій низки нині діючих музеїв Львівського університету, зокрема, Мінералогічного та Зоологічного (засновані на базі Кабінету натуральної історії відповідно геологом Генриком Лобажевським та зоологом Бенедиктом Дибовським), Археологічного, Геологічного. В Університеті діяв також окремий Фізичний музей. Навчальний заклад мав потужні Ботанічний сад і Гербарій, Наукову бібліотеку."
          }, {
            "id": 25,
            "period_id": 2,
            "title": "",
            "description": "В останній третині ХІХ – на початку ХХ ст. викладачі Львівського університету брали участь у діяльності Наукового товариства імені Шевченка у Львові, були ініціаторами заснування наукових товариств та їхніх друкованих органів: Товариства природознавців імені Коперника (1875, друкований орган – “Kosmos”), Історичного (1886, “Kwartalnik Historyczny”), Філологічного (1893, “Eos”), Народознавчого (1895, “Lud”), Філософського (1904, “Przegląd. Filozoficzny”) товариств. Реорганізовано створене ще 1848 р. Правниче товариство (друкований орган з 1876 р. – “Przegląd prawa i administracji”).\n" +
              "У 1894 р. опубліковано працю історика Людвіка Фінкеля та юриста Станіслава Стажинського “Історія Львівського університету” (“Historya Uniwersytetu Lwowskiego”), в якій обґрунтовано, що роком заснування Львівського університету є 1661 р. Цікаво, що в рік 250-річного ювілею навчального закладу (1911/12) його ректором став саме Л. Фінкель – фундатор історії Львівського університету як напряму наукових досліджень та засновник університетського Архіву. На честь відзначення цього ювілею, у 1912 р. Львівський університет надав звання Dr. honoris causa двом нобелівським лауреатам – Нобелівської премії з літератури (1905) Генрику Сенкевичу та Нобелівської премії з фізики (1903) й хімії (1911) Марії Склодовській-Кюрі."
          }, {
            "id": 26,
            "period_id": 2,
            "title": "",
            "description": "У 1914 р. розпочалась Перша світова війна. Багато студентів, випускників та викладачів Львівського університету брали участь у бойових діях, зокрема, як вояки Легіону Українських січових стрільців. У 1914–1915 рр. Львів окупували російські війська, діяльність Львівського університету була паралізована. Спогади про той період залишив професор фізіології та ректор (1912/1913) Львівського університету Адольф Бек (1863–1942). Перша світова війна призвела до розпаду монархії Габсбурґів, утворення незалежних Польської Республіки зі столицею у Варшаві та Західноукраїнської Народної Республіки зі столицею у Львові. Проте, в результаті поразки українців в українсько-польській війні 1918–1919 рр., Львів опинився під владою Другої Речі Посполитої. В історії Львівського університету розпочався новий, польський період."
          }, {
            "id": 27,
            "period_id": 3,
            "title": "",
            "description": "Упродовж 1919 – середини 1920-х років Львівський університет представляли два навчальні заклади: Університет Яна Казімежа у Львові та Український університет у Львові. Виникнення другого університету, який діяв таємно (всупереч заборонам польської влади), зумовила повна полонізація Університету Яна Казімежа у Львові та його бойкот українською громадою. Зважаючи на це, представники західноукраїнської інтелігенції – члени Наукового товариства імені Шевченка, організували спершу українські приватні університетські курси, перетворені згодом в Український університет у Львові. Керівництво обидвома університетами здійснювали академічні сенати, ректори та декани факультетів. Упродовж 1919–1924 рр. в Університеті Яна Казімежа у Львові діяло чотири факультети: філософський, юридичний, медичний та теологічний, в Українському університеті у Львові – філософський, юридичний, медичний та технічний. Професорами обидвох університетів були, здебільшого, випускники Імператорсько-королівського університету імені імператора Франца І у Львові, тож їхній науковий світогляд формувався у межах спільного львівського інтелектуального середовища, проте національно-державні погляди кардинально відрізнялись."
          }, {
            "id": 28,
            "period_id": 3,
            "title": "",
            "description": "Серед викладачів Українського університету у Львові – видатні українські вчені, зокрема, психолог Степан Балей, літературознавці Михайло Возняк, Кирило Студинський та Василь Щурат, фольклорист Філарет Колесса, історики Мирон Кордуба та Іван Крип’якевич, математики Володимир Левицький та Микола Чайковський, юристи Володимир Вергановський, Євген Давидяк, Володимир Охримович, Микола Чубатий, медик Мар’ян Панчишин, антрополог Іван Раковський та інші. Згодом переважна більшість з них стала професорами Львівського державного університету імені Івана Франка, частина – емігрувала. Наприклад, С. Балей у післявоєнний період завідував кафедрою психології виховання Варшавського університету, М. Чубатий був професором Українського вільного університету в Мюнхені, згодом – деканом факультету права і суспільних наук Українського католицького університету ім. св. Климента в Римі, І. Раковський очолював НТШ в Америці."
          }, {
            "id": 29,
            "period_id": 3,
            "title": "",
            "description": "Після припинення українцями в середині 1920-х років українці бойкоту Університету Яна Казімежа у Львові серед його студентів, а також асистентів можна побачити імена багатьох знаних у майбутньому українських учених, наприклад, – археолога Маркіяна Смішка, етнологів Романа Гарасимчука, Катерини Матейко та ін. На той час й аж до радянізації університету до його структури належало п’ять факультетів: гуманітарний, математично-природничий, юридичний, медичний і теологічний. В університетській традиції за кожним з них утвердився окремий колір, відображений у пелеринах професорських чорних тог: у гуманітаріїв пелерини були блакитного кольору, у техніків і природничників – зеленого, у юристів – чорного, у медиків – червоного, у теологів – фіолетового. Натомість урочиста ректорська тога була з яскравочервоного атласу з горностаєвою пелериною, поверх якої одягався ланцюг."
          }, {
            "id": 30,
            "period_id": 3,
            "title": "",
            "description": "Ще в 1920 р. Університету Яна Казімежа у Львові передали будівлю колишнього Галицького крайового сейму (зведена у 1878–1881 рр. за проектом архітектора Юліуша Гохбергера), яка стала головним корпусом університету й одним із його символів. В університетську традицію органічно увійшло й скульптурне оформлення будівлі роботи члена Флорентійської академії мистецтв Теодора Риґера, зокрема, алегорична група “Опікунчий дух Галичини” над центральним атиком фасаду та композиції “Праця” й “Освіта” обабіч головного входу. У вестибюлі університету були скульптури хрестителів Русі та Польщі та їхніх видатних правителів-законодавців – Володимира Великого та Мєшка І, Ярослава Мудрого та Казімежа ІІІ Великого. Університетські урочистості відбувалися в Аулі (нині Актова зала) та “Залі маршалків” (нині Дзеркальна зала), інтер’єр яких прикрашали полотна Яна Матейка – відповідно “Люблінська унія” (1869) та “Конституція 3 травня” (1891). Площу перед університетом, де відбувалась імматрикуляція (посвята в студенти) першокурсників, прикрашала чавунна ваза з барельєфами, які у вільній інтерпретації повторювали роботу данського скульптора Бертеля Торвальдсена “Течія людського життя”."
          }, {
            "id": 31,
            "period_id": 3,
            "title": "",
            "description": "Частина аудиторій у будівлі на вул. Маршалковській (нині Університетська, 1) мала характерні назви. Однією з найвідоміших серед них була Коперниківська аудиторія (нині ауд. 216). У 1928–1934 рр. для Львівського університету збудували нову лекційну залу – “Colegium maximum” (нині приміщення Центру культури та дозвілля).\n" +
              "Упродовж міжвоєнного періоду у Львівському університеті продовжували розвиватися вже традиційні наукові школи, а також формувалися нові. Світове визнання здобула львівська математична школа Стефана Банаха (1892–1945) та Гуґо Штайнгауза (1887–1972), серед найважливіших досягнень якої – створення основ функціонального аналізу, застосування топологічних методів в аналізі, трактування ймовірності як міри, глибокі дослідження в теорії функцій дійсної змінної та теорії ортогональних і тригонометричних рядів. Улюбленим місцем математиків Львівського університету для відпочинку й наукових дискусій була Шотландська (Шкотська) кав’ярня (нині проспект Шевченка, 27). Саме тут створено всесвітньовідому “Шотландську (Шкотську) книгу”, в якій львівські математики та вчені з інших країн, що відвідували Львів, записували нові математичні проблеми. Чільним представником наукової школи С. Банаха був Станіслав Улям (1909–1984) – один із розробників (поряд з Едвардом Теллером та Георгієм Гамовим) американської водневої бомби (1952)."
          }, {
            "id": 32,
            "period_id": 3,
            "title": "",
            "description": "Світове визнання здобула й львівсько-варшавська логіко-філософська школа, заснована професором Казімежом Твардовським (1866–1938). Її представники – польські та українські інтелектуали, зокрема, Казімеж Айдукевич, Ян Лукасевич, Владислав Татаркевич, Альфред Тарський, Степан Балей та інші, працювали в руслі логічного позитивізму. В тодішній західноєвропейській філософії теоретичні засади цього напряму розробляв Людвіґ Вітґенштайн, а також Моріц Шлік, з Віденським гуртком якого львівсько-варшавська логіко-філософська школа мала тісні зв’язки. Наприкінці 1920-х років А. Тарський був кандидатом на завідувача кафедри математичної логіки Львівського університету, але завдяки протекції філософа Бертрана Рассела її посів Леон Хвістек. У 1920–1930-х роках у філософію у Львівському університеті викладав й Роман Інґарден (1893–1970), учень засновника феноменології Едмунда Гусерля."
          }, {
            "id": 33,
            "period_id": 3,
            "title": "",
            "description": "Потужною була львівська історико-правова школа, заснована Освальдом Бальцером (1858–1933). За майже півстоліття своєї викладацької діяльності у Львівському університеті професор підготував три покоління відомих істориків права. Один з учнів О. Бальцера – професор Пшемислав Домбковський (1877–1950), у 1926 р. ініціював подання кандидатури О. Бальцера на здобуття Нобелівської премії миру."
          }, {
            "id": 34,
            "period_id": 3,
            "title": "",
            "description": "Відомими були наукові школи історичного спрямування: історії та культури польських міст Яна Птасьніка, соціально-економічної історії Францішека Буяка, античної археології Едмунда Булянди, доісторичної археології Польщі Леона Козловського, львівська етнологічна школа Адама Фішера та львівська антропологічна школа Яна Чекановського.\n" +
              "Ще в астрійський період у Львівському університеті почали розвиватися наукові напрями, пов’язані з історією та теорією мистецтва. У міжвоєнний період вони оформились в окремі наукові школи – музикологічну школу Адольфа Хибінського (1880–1952) та школу історії і теорії мистецтва Владислава Подляхи (1875–1951). В. Подляха очолював у Львівському університеті Інститут історії польського та східноєвропейського мистецтва. Іншим мистецтвознавчим осередком в університеті був Інститут історії мистецтва Нового часу, очолений професором Владиславом Козицьким (1879–1936), знавцем італійського мистецтва епохи Ренесансу та творчості Рембрандта ван Рейна. Ці інститути мали потужні мистецтвознавчі збірки, частина експонатів яких згодом опинилась у фондах кабінету мистецтвознавства Львівського державного університету імені Івана Франка. Під керівництвом В. Подляхи та В. Козицького свою науково-педагогічну діяльність розпочав всесвітньо відомий науковець-гуманіст Мечислав Ґембарович, а також історик мистецтва графиня Кароліна Лянцкоронська."
          }, {
            "id": 35,
            "period_id": 3,
            "title": "",
            "description": "Професори Львівського університету зробили значний вклад у світову науку. Так, професор Рудольф Вайґль (1883–1957) відкрив вакцину проти тифу, а його лабораторія стала світовим центром з вивчення рикетсіозних захворювань (у 1948 р. учений був серед номінантів на здобуття Нобелівської премії з медицини та фізіології). Й досі важливе значення в біології має загальна схема гліколізу, розроблена професором біохімії Якубом Парнасом (1884–1949)."
          }, {
            "id": 36,
            "period_id": 3,
            "title": "",
            "description": "У міжвоєнний період викладачі Львівського університету підтримували тісні зв’язки з європейськими та північноамериканськими вченими. Так, фізик Леопольд Інфельд (1898–1968) у 1930-х роках працював у Прінстоні з Альбертом Айнштайном, з яким познайомився ще 1920 р. Згодом у їхньому співавторстві опубліковано працю “Еволюція фізики”. Передмову до англомовної праці “Кашубська цивілізація” (“The Cassubian Civilization”, 1935), авторства етнолога Адама Фішера та мовознавців Тадеуша Лер-Сплавінського й Фрідріха Лоренца, написав засновник теорії функціоналізму Броніслав Малиновський, а до англомовної праці антрополога Станіслава Клімека “Структура культури індіанців Каліфорнії” (“The Structure of California Indian Culture”, 1935) – Альфред Кребер, професор антропології Каліфорнійського університету, один з найвидатніших американських народознавців першої половини ХХ ст."
          }, {
            "id": 37,
            "period_id": 3,
            "title": "",
            "description": "У 1920–1930-х роках Львівський університет був серед провідних лінгвістичних центрів Центральної та Східної Європи. Крім більшості європейських мов, латини, греки та старослов’янської мови, тут вивчали хетську, староєврейську (гебрайську), арамейську, арабську, турецьку, монгольську, манджурську, уйгурську, іранську, індійську філологію. Свого часу в університеті планували відкрити й кафедру есперанто. Одним з головних викладачів-мовознавців Львівського університету був індоєвропеїст та семітолог Єжи Курилович, який розвинув такий напрям, як порівняльне (загальне) мовознавство (відповідну кафедру очлював до 1946 р.). Сучасний польський письменник Марек Краєвський зробив професора Є. Куриловича героєм свого твору “Числа Харона”."
          }, {
            "id": 38,
            "period_id": 3,
            "title": "",
            "description": "У міжвоєнний період у Львівському університеті навчалися студенти, які здобули світове визнання в різних ділянках науки, культури та громадського життя. Так, у 1923 р. філософський факультет закінчив один з найвидатніших українських поетів ХХ ст. Богдан Ігор Антонич (1909–1937). Саме у Львівському університеті він уперше представив публіці низку віршів зі збірки “Привітання життя” (1931). Нині на філологічному факультеті університету є іменна аудиторія Б. І. Антонича."
          }, {
            "id": 39,
            "period_id": 3,
            "title": "",
            "description": "На юридичному факультеті Львівського університету навчався відомий український композитор Богдан Весоловський (1915–1971). Він почав писати музику з 16 років, а у 22-річному віці написав одну зі своїх найпопулярніших пісень – “Прийде ще час”:\n" +
              "“Прийде ще час коли затужиш ти за мною,\n" +
              "Прийде ще час, коли згадаєш наші дні,\n" +
              "Може тоді любов ти зрозумієш мою,\n" +
              "І може за ту любов вдячна будеш мені”.\n" +
              "Композиції Б. Весоловського в жанрі танго, фокстроту та легкого вальсу якнайкраще відображають атмосферу міжвоєнного Львова."
          }, {
            "id": 40,
            "period_id": 3,
            "title": "",
            "description": "Випускником юридичного факультету (1925) був Рафал Лемкін (1900–1959) – фахівець з міжнародного права, який у 1930-х роках почав дослідження винищення цивільного вірменського населення в Османській імперії, на основі чого представив у Лізі Націй пропозиції стосовно міжнародних юрисдикцій проти тероризму та знищення національних, релігійних і расових груп. У 1944 р. у праці “Axis Rule In Occupied Europe: Laws Of Occupation, Analysis Of Government, Proposals For Redress” Р. Лемкін увів у науковий обіг термін “геноцид” (від давньогрец. γένος – рід, родина, плем’я, народ та лат. caedo – вбивати). Більшість рідних Р. Лемкіна загинули під час Голокосту. Вченому вдалось емігрувати до США, й у 1945–1946 рр. він був радником Верховного суду США на Нюрнберзькому процесі. З 1948 р. викладав у Єльському університеті. А 9 грудня цього ж року прийнято резолюцію 260 Генеральної Асамблеї ООН (“Конвенція про запобігання та покарання злочинів геноциду”, фактичним творцем якої став Р. Лемкін). У 1953 р. (в 20-ту річницю Голодомору в Україні) у Нью-Йорку Р. Лемкін виголосив доповідь “Радянський геноцид в Україні”, ставши першим із фахівців з міжнародного права, який визначив та наукового обґрунтував злочини сталінського комуністичного режиму проти українців як геноцид."
          }, {
            "id": 41,
            "period_id": 4,
            "title": "",
            "description": "У Західній Україні комуністичний режим встановлено восени 1939 р., коли ці терени з центром у Львові приєднали до Української РСР – однієї з республік Радянського Союзу. Тоді ж у Львівському університеті (з 8 січня 1940 р. – Львівському державному університеті імені Івана Франка) розпочалась радянізація: ліквідовано теологічний факультет, медичний факультет перетворено на Львівський медичний інститут (у 1939 р. на медичний факультет вступив майбутній письменник-фантаст Станіслав Лем). З гуманітарного факультету створено філологічний та історичний факультети, а з математично-природничого – фізико-математичний та природничий. Продовжив свою діяльність юридичний факультет. У повоєнні роки факультетська структура Львівського університету змінювалась: природничий факультет у 1945 р. розділено на біологічний, географічний, геологічний і хімічний, а фізико-математичний у 1953 р. – на фізичний та механіко-математичний; створено факультети іноземних мов (1950), журналістики (1953), економічний (1966), прикладної математики та інформатики (1975)."
          }, {
            "id": 42,
            "period_id": 4,
            "title": "",
            "description": "Радянський період в історії Львівського університету був суперечливим. Українізація та відносна ідеологічна свобода – за ректорства історика Михайла Марченка (1939–1940) та геолога Євгена Лазаренка (1951–1963), змінювалась посиленням русифікації та ідеологічного тиску. Зокрема, зазначених ректорів, які намагались перетворити Львівський університет на потужний осередок української науки та культури (за ректорства М. Марченка його назва звучала як “Львівський український державний університет”), усунули від керівництва за звинуваченням в українському націоналізмі. А прізвище першого повоєнного ректора Львівського університету – юриста Миколи Паше-Озерського (1944), в радянський час узагалі “витерли” з університетської історії."
          }, {
            "id": 43,
            "period_id": 4,
            "title": "",
            "description": "Та своєрідним рубежем між класичним та модерним періодами в історії Львівського університету став не 1939 рік, а Друга світова війна та завершення радянізації Західної України наприкінці 1940-х років. Так, більшість професорів Університету Яна Казімежа у Львові залишилась працювати у Львівському державному університеті імені Івана Франка до нацистської окупації Львова, а частина – ще й у перші повоєнні роки. Останнім польським професором Львівського університету був юрист Юліуш Макаревич, який працював у рідному для себе навчальному закладі до своєї смерті в 1955 р. Під час Другої світової війни зруйновано й символічний світ довоєнного Львівського університету, який уособлювала Ауля (її інтер’єр знищив вибух бомби). Під час нацистської окупації втрат зазнали й Наукова бібліотека Університету, кафедральні бібліотеки, музейні збірки."
          }, {
            "id": 44,
            "period_id": 4,
            "title": "",
            "description": "Та найбільшими були людські втрати, яких Львівський університет почав зазнавати ще до початку німецько-радянської війни. 15–18 січня 1941 р. радянська влада провела “Процес 59-ти” – перед судом постали 59 українців (37 юнаків та 22 дівчнини віком від 16 до 30 років), здебільшого – студенти Львівського університету, звинувачені у приналежності до Організації українських націоналістів, антирадянській діяльності та підготовці повстання проти радянської влади. 19 засуджених розстріляно."
          }, {
            "id": 45,
            "period_id": 4,
            "title": "",
            "description": "У ніч з 3 на 4 липня 1941 р. у парковолісовій зоні між вулицями Вулецькою і Кадетською (нині вулиці Андрія Сахарова та Героїв Майдану) нацисти здійснили масовий розстріл львівських науковців. Серед убитих – професори Львівського університету, зокрема, останній ректор Університету Яна Казімежа у Львові юрист Роман Льоншан де Бер’є (1883–1941) та письменник і літературознавець Тадеуш Бой-Желенський (1874–1941). Багато викладачів та студентів Львівського університету були учасниками руху Опору, загинули під час військових дій, у концтаборах та гетто. Трагічною є історія Мартини Ґриґляшевської-Пузини (1903–1986) – асистентки професора антропології Яна Чекановського та невістки колишнього ректора Львівського університету, князя Юзефа Пузини (1856–1919). У березні 1943 р. вона була заарештована Гестапо й ув’язнена в концтаборі Аушвіц (Освенцім). Там, під загрозою смерті, М. Ґриґляшевська-Пузина з квітня 1944 р. до січня 1945 р. була змушена працювати з німецьким лікарем Йозефом Менґеле, який проводив експерименти над в’язнями концтабору. Вчена психологічно надзвичайно важко переносила працю з Й. Менґеле, намагалася задокументувати його злочини (згодом її нотатки використано для засвідчення нацистських злочинів). У другій половині 1940-х років М. Ґриґляшевська-Пузина емігрувала до Великої Британії, пізніше – до Південно-Африканської Республіки, але потім повернулась на туманний Альбіон. Попри постійні пропозиції від антропологічних наукових центрів (зокрема, американських) до співпраці, після пережитого вона вже ніколи не змогла займатися антропологічними дослідженнями."
          }, {
            "id": 46,
            "period_id": 4,
            "title": "",
            "description": "Після закриття нацистами більшості навчальних та наукових закладів (зокрема, і Львівського університету, в головному корпусі якого розмістили канцелярію ландскомісара), частина львівських науковців виживала завдяки професору Р. Вайґлю, бактеріологічний інститут якого продовжував працювати. Такі відомі професори, як лікар-бактеріолог Людвік Флек, ботанік Северин Кшеменевський, математик Стефан Банах, юрист Станіслав Губерт та багато інших працювали в ньому “годувальниками вошей” (донорами крові). Попри труднощі, польські професори Львівського університету в роки заборони діяльності навчального закладу нацистами, налагодили діяльність таємного Університет Яна Казімежа у Львові.\n" +
              "У повоєнні роки Львівський університет відчував постійний тиск радянської партійної влади, яка проводила періодичні “ідеологічні чистки”. Найбільші з них припали на 1970–1973 рр.: за “безініціативність у громадському житті й політичну інертність”, “націоналістичний ухил”, зв’язки з дисидентами, виготовлення самвидаву з роботи звільнено філологів Богдана Леськіва, Любомиру Попадюк, Івана Ковалика, Теоктиста Пачовського, Йосипа Кобіва, Ірину Гузар, істориків Миколу Кравця, Олександра Карпенка, Юрія Сливку та ін. У 1972 р. на тривалий термін за “очорнення сучасної радянської дійсності” засуджено студента філологічного факультету Зоряна Попадюка та випускників цього ж факультету Ігоря та Ірину Калинців. У 1973 р. органи безпеки провели кампанію осуду групи студентів історичного та філологічного факультетів, які критикували радянську національну політику за русифікацію та поширювали антирадянські листівки: з університету відрахували близько десяти студентів, у тому числі, відмінників навчання Івана Сварника, Мар’яну Долинську, Степана Слуку, Леоніда Філонова, Ігоря Кожана, Романа Козовика та Ігоря Худого."
          }, {
            "id": 47,
            "period_id": 4,
            "title": "",
            "description": "Та попри всі негативи, навчально-науковий процес у Львівському державному університеті Імені Івана Франка був на високому рівні, передусім завдяки зусиллями таких видатних учених, як історики Іван Крип’якевич, Мирон Кордуба, Дмитро Похилевич, філологи Іларіон Свєнціцький, Михайло Возняк, Василь Щурат, Філарет Колесса, Юрій Мушак, Михайло Рудницький, Олексій Чичерін, математики Мирон Зарицький, Володимир Левицький, Микола Чайковський, Борис Гнєденко, геологи Володимир Сельський, Олег Вялов, Володимир Соболєв, Володимир Порфір’єв, біологи та ботаніки Михайло Попов, Сергій Гребінський, Лев Литвинов, Андрій Лазаренко та ін."
          }, {
            "id": 48,
            "period_id": 4,
            "title": "",
            "description": "У 1960–1980-х роках визнання у науковому світі здобули викладачі Львівського університету, які були його повоєнними випускниками. Владислав Лянце (1920–2007) уперше в Україні розпочав дослідження в галузі нестандартного аналізу, зокрема, розробив теорію колостандартності на гіперскінченних множинах. Остап Парасюк (1921–2007) запропонував новий метод розв’язування пружно-пластичних задач для пластинок з круговим отвором, довів багатовимірну локальну граничну теорему теорії ймовірності. Ярослав Підстригач (1928–1990) став основоположником теоретичного моделювання в механіці деформівних середовищ з урахуванням їхньої структури, взаємозв’язку процесів механічної та немеханічної природи. Метод колективних змінних та метод зміщень і колективних змінних, які дали змогу розв’язати серію принципових проблем фізики конденсованої речовини, запропонував Ігор Юхновський (1925 р. н.). Ярослав Дутчак (1933–1988) започаткував науковий напрям рентгенної спектроскопії, розробив методики рентгенографії, електронної і растрової мікроскопії. Орест Влох (1934–2009) сформував наукову школу з кристалооптики і структурних фазових переходів, а Євген Гладишевський (1924–2012) став одним із засновників львівської кристалохімічної школи. Значний вклад у дослідження колоїдно-хімічних властивостей поверхнево-активних емульгаторів зробив Роман Кучер (1925–1991), у розвиток геології – Орест Матковський, географії – Олег Шаблій та Ярослав Кравчук, гуманітарних наук – філософ Андрій Пашук, журналіст Володимир Здоровега, історики Ярослав Кісь, Василь Інкін, Степан Макарчук, Микола Крикун, філологи Іван Денисюк, Костянтин Трофимович, Роман Оленич та ін. Юрист Володимир Кульчицький (1919–2009) став фундатором нової львівської історико-правової школи."
          }, {
            "id": 49,
            "period_id": 4,
            "title": "",
            "description": "У Львівському університеті розпочала свій трудовий шлях Катерина Ющенко (1919–2001) – розробник Адресної мови програмування (випередила перші мови програмування Фортран, Кобол і Алгол), яка підготувала появу не тільки мов програмування з апаратом непрямої адресації, але й асамблерів.\n" +
              "Великої уваги у Львівському державному університеті імені Івана Франка надавали художній самодіяльності. Cтворено літературну студію “Франкова кузня” (1946), народний ансамбль пісні й танцю “Черемош” (1963), народний камерний оркестр (1981), народну чоловічу хорову капелу “Прометей” (1965), народну капелу бандуристок “Зоряниця” (1982). Викладачі та студенти університету організовували постановки п’єс видатних драматургів. У другій половині 1950 – на початку 1960-х років, за сприяння ректора Є. Лазаренка, в університеті часто виступали з лекціями та декламуванням віршів Максим Рильський, Андрій Малишко, шістдесятники Іван Дзюба, Іван Драч, Микола Вінграновський, Дмитро Павличко."
          }, {
            "id": 50,
            "period_id": 4,
            "title": "",
            "description": "У 1950–1960-х роках у Львівському державному університеті імені Івана Франка відзначено низку важливих для української культури ювілеїв. У 1956 р. – 100-річчя від дня народження Івана Франка, 1961 р. – 300-річчя від заснування Львівського університету та 100-річчя від дня смерті Тараса Шевченка, 1964 р. – 150-річчя від дня народження Кобзаря. У ці ювілейні роки в університеті відкрито Франкову (1956) та Шевченкову (1961) аудиторії, проведено наукові конференції. До 150-річчя від дня народження Т. Шевченка приурочений візит до СРСР одного з найвідоміших інтелектуалів ХХ ст. Жана-Поля Сартра. У 1964 р. цей філософ-екзистенціаліст та лаурет Нобелівської премії з літератури прочитав у Львівському університеті декілька лекцій. Того ж року перед головним корпусом Львівського університету урочисто відкрили пам’ятник І. Франку."
          }, {
            "id": 51,
            "period_id": 4,
            "title": "",
            "description": "Упродовж другої половини ХХ ст. зросла матеріальна база Львівського університету: відбудовано Актову залу, створено й обладнано нові навчальні, наукові й проблемні лабораторії, шість музеїв, Астрономічну обсерваторію у Брюховичах під Львовом, агробіологічну станцію в Карпатах, географічний стаціонар над Бистрицею, спортивно-оздоровчий табір “Карпати”, спорткомплекс, збудовано корпус фізичного факультету (нині – факультету електроніки та комп’ютерних технологій) та новий бібліотечний корпус на вул. М. Драгоманова, гуртожитки в районі вул. Пасічної. Львівському університету передано й будівлю колишньої Генеральної греко-католицької духовної семінарії (нині корпус географічного факультету на вул. Дорошенка, 41)."
          }, {
            "id": 52,
            "period_id": 4,
            "title": "",
            "description": "Крім співпраці з університетами СРСР, у 1950–1980-ті роки активізувались зовнішні зв’язки Львівського університету з вищими навчальними закладами Польщі (Університетом імені Марії Кюрі-Склодовської в Любліні, Вищою педагогічною школою (нині Педагогічною академією) в Кракові, Варшавським університетом), Болгарії (Великотирновським університетом), Чехословаччини (Оломоуцьким університетом), країн Азії, Африки, Латинської Америки.\n" +
              "У другій половині 1980-х років у вищих навчальних закладах Львова виникли нові громадські товариства Студентського братства, які висували національні вимоги. Масштабну просвітницьку діяльність розгорнуло Товариство української мови, структуру якого у Львівському університеті очолив професор Теофіль Комаринець. Весною 1989 р. Львовом пройшла хвиля протестів і демонстрацій, спрямованих проти радянської влади – їхніми учасниками були й студенти Львівського університету. У травні того ж року відбувся з’їзд народних депутатів нової Верховної Ради СРСР, обраної вже поза диктатом КПРС. До її складу ввійшов і професор Львівського університету Іван Вакарчук."
          }, {
            "id": 53,
            "period_id": 4,
            "title": "",
            "description": "У жовтні 1990 р. у Києві відбулися протестні акції студентів, які вимагали від влади недопущення підписання нового союзного договору, не пізніше весни 1991 р. організувати перевибори Верховної Ради УРСР на багатопартійній основі, відставки голови Ради Міністрів УРСР Віталія Масола, повернення на територію УРСР українських солдатів, а також забезпечення проходження військової служби юнаками-українцями винятково на території республіки та ін. Активними учасниками “Революція на граніті”, яка стала важливим сигналом необхідності змін, були й студенти Львівського державного університету імені Івана Франка."
          }, {
            "id": 54,
            "period_id": 4,
            "title": "",
            "description": "У переломний для історії України 1991 р. Університет вступив з новим, першим демократично обраним ректором: у грудні 1990 р. ним став І. Вакарчук."
          }, {
            "id": 55,
            "period_id": 5,
            "title": "",
            "description": "Здобуття Україною незалежності 24 серпня 1991 р. відкрило перед навчальним закладом нові можливості для розвитку. Так, у серпні 1991 р. Вчена рада Університету постановила переходити до викладання усіх предметів українською мовою. У 1992 р. відновлено філософський факультет (існував упродовж 1761–1924 рр.) (очолив Андрій Пашук) та створено факультет міжнародних відносин (його першим деканом став Маркіян Мальський). Того ж року І. Вакарчук запровадив тестові випробування під час вступу до Львівського університету (пізніше цю систему вступу схвалили на державному рівні)."
          }, {
            "id": 56,
            "period_id": 5,
            "title": "",
            "description": "Ринкові умови, тенденції розвитку світу до глобалізації та універсалізації спонукали швидко реагувати на запити та гнучко перетворювати освітні стандарти і норми, зважаючи на нові виклики та зміни на ринку праці. З цією метою 1997 р. в Університеті розпочали впровадження експериментальної магістерської програми гуманітарного напряму. Вона дала змогу випробувати відповідну гнучкість академічних програм, певну міждисциплінарність та інтегрованість курсів і спецкурсів. Уперше в Україні було підготовлено і запроваджено міждисциплінарні програми з європейських студій, філософії науки, економічної теорії.\n" +
              "Підтвердженням того, що Львівський університет за результатами своєї діяльності здобув загальнодержавне визнання, є ініціатором найважливіших державних освітніх та наукових реформ, вищим навчальним закладом освіти ІV рівня акредитації із максимальним для державних навчальних закладів статусом автономії (1994), стало надання Львівському державному університету імені Івана Франка статусу національного (Указ Президента України № 1311/99 від 11 жовтня 1999 р.). Незадового до цієї події, 19 березня 1999 р. затверджено нові університетські герб та хоругву. Поряд з гаслом “Patriae decori civibus educandis” (“Батьківщину прикрашають освічені громадяни”) та гімном “Вічний революціонер” (слова Івана Франка, музика Миколи Лисенка) вони стали неодмінними символами Львівського університету."
          }, {
            "id": 57,
            "period_id": 5,
            "title": "",
            "description": "“...Вічний революціонер – / Дух, наука, думка, воля...” Нині, в ХХІ ст. ці рядки патрона Львівського університету – Івана Франка, якнайкраще дозволяють охарактеризувати суть Університету, в структурі якого – 19 факультетів (природничі і технічні – біологічний, географічний, геологічний, хімічний, фізичний, електроніки та комп’ютерних технологій, прикладної математики та інформатики, механіко-математичний; соціо-гуманітарні – юридичний, економічний, управління фінансами та бізнесу, міжнародних відносин, педагогічної освіти, журналістики, філологічний, іноземних мов, філософський, історичний, культури і мистецтв), три коледжі (Природничий, Правничий та Педагогічний), дві загальноуніверситетські кафедри (фізичного виховання та спорту, безпеки життєдіяльності), сім інститутів (європейської інтеграції, екології масової інформації, літературознавчих студій, франкознавства, славістики, історичних досліджень, археології), а також – Наукова бібліотека, Архів, Астрономічна обсерваторія, Ботанічний сад та шість музеїв (Рудних формацій, Мінералогічний, Палеонтологічний, Зоологічний, Археологічний, Історії Університету)."
          }, {
            "id":58 ,
            "period_id": 5,
            "title": "",
            "description": "Дух. Це слово має дуже глибокий зміст. Одним з головних його значень для Львівського університету є плекання традицій та впровадження новацій. Попри те, що в історії Університету є різні періоди, вони поєднані між собою, і не лише завдяки університетській структурі, а й за моделлю “вчителі – учні”. Яскравим прикладом цього є сучасна львівська історико-правова наукова школа. Її фундатор – Володимир Кульчицький (закінчив юридичний факультет у 1948 р.), навчався у Пшемислава Домбковського та Кароля Корания (викладали у Львові до 1945–1946 рр.), які, в свою чергу, були учнями Освальда Бальцера. Для безпосередньої тяглості історії філологічної науки у Львівському університеті вузловими постатями є Михайло Рудницький (1889–1975), Михайло Возняк (1881–1954), Іларіон Свєнціцький (1876–1956), Єжи Курилович (1895–1978). Так, М. Рудницький – завідувач кафедр історії західноєвропейської літератури та англійської філології, професор кафедри української літератури та декан філологічного факультету й факультету іноземних мов, під час свого навчання у Львівському університеті на початку ХХ ст. відвідував лекції Яна Каспровича, Кирила Студинського та Олександра Колесси. Натомість останній був учнем Омеляна Огоновського, а той, у свою чергу, – першого завідувача кафедри руської словесності (української мови та літератури) Якова Головацького, відкритої ще 1848 р. Тяглість добре ілюструє й історія та сучасність класичної філології у Львівському університеті: геніальний сучасний філолог-класик професор Андрій Содомора був студентом Йосипа Кобіва та Юрія Мушака, викладачів, які вивчали класичні мови ще в Університеті Яна Казімежа у Львові. І таких прикладів тяглості з різних галузей знань можна навести безліч."
          }, {
            "id":59 ,
            "period_id": 5,
            "title": "",
            "description": "У контексті тяглості традиції відзначимо, що з 2000 р., з ініціативи нинішнього ректора Львівського національного університету імені Івана Франка Володимира Мельника, почергово у Львові та Варшаві проводять Львівсько-Варшавський семінар з філософії науки, в якому беруть участь науковці Львівського та Варшавського університетів. Це своєрідне продовження традицій львівсько-варшавської логіко-філософської школи."
          }, {
            "id": 60,
            "period_id": 5,
            "title": "",
            "description": "Дух Львівського університету поєднує фізиків та ліриків, багато його викладачів є водночас науковцями і митцями. Так, у 1991–1996 рр. на фізичному факультеті, а далі – в аспірантурі при кафедрі теоретичної фізики навчався Святослав Вакарчук – лідер гурту “Океан Ельзи”. Професор механіко-математичного факультету Михайло Зарічний відомий і як поет, а професор кафедри теорії та історії політичної науки Валерій Денисенко – і як художник. На філологічному факультеті викладають українські поети Галина Крук, Назар Федорак, Остап Сливинський, а на факультеті культури і мистецтв – актори та режисери Богдан Козак і Федір Стригун, композитор Олександр Козаренко. Багато видатних творчих особистостей є і серед випускників Університету останніх років: лідер гурту “Один в каное” Ірина Швайдак (випускниця філологічного факультету), поетеса Юлія Мусаковська (випускниця факультету міжнародних відносин) та ін."
          }, {
            "id": 61,
            "period_id": 5,
            "title": "",
            "description": "Дух Львівського університету поєднує фізиків та ліриків, багато його викладачів є водночас науковцями і митцями. Так, у 1991–1996 рр. на фізичному факультеті, а далі – в аспірантурі при кафедрі теоретичної фізики навчався Святослав Вакарчук – лідер гурту “Океан Ельзи”. Професор механіко-математичного факультету Михайло Зарічний відомий і як поет, а професор кафедри теорії та історії політичної науки Валерій Денисенко – і як художник. На філологічному факультеті викладають українські поети Галина Крук, Назар Федорак, Остап Сливинський, а на факультеті культури і мистецтв – актори та режисери Богдан Козак і Федір Стригун, композитор Олександр Козаренко. Багато видатних творчих особистостей є і серед випускників Університету останніх років: лідер гурту “Один в каное” Ірина Швайдак (випускниця філологічного факультету), поетеса Юлія Мусаковська (випускниця факультету міжнародних відносин) та ін.\n" +
              "Фото 6–9\n" +
              "Дух Львівського університету неможливо уявити без прагнення до новацій та академічної свободи. І. Вакарчук, будучи на посаді Міністра освіти і науки України (2007–2010), ініціював та втілив реформи, визнані одними з найвагоміших у незалежній Україні: запровадження зовнішнього незалежного оцінювання та принципу державно-громадського управління освітою, надання можливості суттєвого розширення автономії вищих навчальних закладів, впровадження додатка до диплома європейського зразка та відкритої процедури ліцензування й акредитації вищих навчальних закладів, створення належних умов для функціонування та розвитку української мови в освітній і науковій сфері, розвитку інклюзивної освіти та ін. У 2004/05 навчальному році Львівський університет разом з Національним університетом “Києво-Могилянська академія” та Українським католицьким університетом ініціював експериментальний проект університетської автономії. У травні 2005 р. офіційно розпочало діяльність Студентське самоврядування Львівського університету, діяльність якого спрямована на захист прав та інтересів студентської громади. Ініціатива студентів Львівщини щодо студентського самоврядування сприяла винесенню цього питання на законодавчий рівень. У 2009 р. “за особливу роль Львівського національного університету імені Івана Франка в розбудові української державності, розвитку національної освіти, науки, культури і духовності, формуванні національної еліти” Університетові надано статус самоврядного (автономного) дослідницького національного вищого навчального закладу.\n" +
              "Ще один прояв духу Львівського університету – мобільність. На початку ХХІ ст. у Львівському університеті підготовлено та запроваджено нову концепцію вивчення іноземних мов, яка відповідає широкій міжнародній практиці. Студенти мають змогу вивчати близько 30 іноземних мов, зокрема усі слов’янські. Одним із постійних освітніх заходів Університету є літні школи з української мови для іноземців.\n" +
              "Наука, думка. У Львівському університеті розвивається понад 20 наукових шкіл: теоретична фізика, фізика твердого тіла, фізико-хімія полімерів, кристалохімія інтерметалічних сполук, біохімія і молекулярна біологія, селекція та генетична інженерія промислових мікроорганізмів, генетика, біоенергетика й електрофізіологія секреторних клітин, комплексний аналіз, функціональний аналіз, механіка, чисельне моделювання й оптимізація фізико-механічних полів, термобарогеохiмiя, мiнералогiя, географічне українознавство, інженерна та екологічна геоморфологія, розвиток агропромислового комплексу західного регіону України, економіко-математичне моделювання, перекладознавство, франкознавство, слов’янознавство, історія і культура західноукраїнських земель, етнологія, соціологія, теорія та історія журналістики, історія філософії, теорія та історія держави і права, кримінальне право і процес та ін."
          }, {
            "id": 62,
            "period_id": 5,
            "title": "",
            "description": "Викладачі Львівського університету – лауреати багатьох премій. Зокрема, найвищу вітчизняну наукову нагороду – Державну премію України в галузі науки і техніки, за останні роки отримали Іван Вакарчук (2000, за авторський підручник “Квантова механіка”), Йосип Стахіра (2001, за досягнення у дослідженнях нових фізичних ефектів у сильно анізотропних напівпровідниках і приладах на їхній основі), Мар’ян Мисків (2007, як співавтор циклу наукових праць “Супрамолекулярні координаційні сполуки”), Роман Гладишевський, Василь Заремба, Ярослав Каличак, Богдан Котур, Володимир Павлюк та Юрій Стадник (2008, за роботу “Інтерметаліди, гідриди та оксиди як основа нових енергоощадних матеріалів”), Юрій Щербина (2009, як співавтор комплексу підручників “Інформатика”), Георгій Сулим (2011, як співавтор циклу праць “Теорія і методи розрахунку напруженого стану та міцності твердих деформівних тіл з концентраторами напружень”), Роман Хапко (2012, за участь у написанні циклу наукових праць “Дискретні та функціональні методи теорії наближення та їх застосування”), Богдан Новосядлий (2014, за колективну роботу “Будова та еволюція Всесвіту на галактичних та космологічних масштабах, прихована маса і темна енергія: теоретичні моделі та спостережні результати”), Леонтій Войтович (2014, як співавтор п’ятитомної “Історії української культури”), Леонід Зашкільняк (2016, за роботу над “Енциклопедією історії України”)."
          }, {
            "id": 63,
            "period_id": 5,
            "title": "",
            "description": "Значними є наукові досягнення й студентів і випускників Львівського університету. Наприклад, студент хімічного факультету Андрій Нещадін двічі (2011, 2012) став переможцем міжнародної олімпіади з хімії. Декількма роками раніше студенти факультету прикладної математики та інформатики Руслан Бабіля, Василь Білецький та Остап Коркуна вибороли спочатку перше місце на Міжнародній олімпіаді з програмування (Румунія, 2007), а згодом – на Чемпіонаті світу з програмування (Канада, 2008). Нині О. Коркуна працює в головному офісі компанії Марка Цукерберґа Facebook – найбільшої соціальної мережі світу (1,5 мільярда користувачів), його команда займається розробкою системи, яка дозволяє автоматично виявляти технічні несправності соцмережі."
          }, {
            "id": 64,
            "period_id": 5,
            "title": "",
            "description": "Такі історії успіху українців надихають! У травні 2014 р. магістр, а нині – аспірант кафедри соціології Тарас Прокопишин започаткував проект “The Ukrainians” – журнал про українців, ініціативу та відповідальність, серед завдань якого: розповідати про Україну та мотивувати до позитивних змін через історії успіху людей та ініціатив."
          }, {
            "id": 65,
            "period_id": 5,
            "title": "",
            "description": "У стінах Львівського університету виступали з доповідями та лекціями інтелектуали світового масштабу: норвезький письменник Юстейн Ґордер (2009), лауреат Нобелівської премії з хімії (1987, за синтез криптандів) професор Страсбурзького університету Жан-Марі Лен (2010). У 2013 р. лекцію на тему “Невелике доповнення до довгої соціальної історії часу” в Актовій залі Університету прочитав один із творців концепції постмодернізму, професор Університету Лідса Зиґмунт Бауман. У жовтні 2015 р. Львівський університет відвідав ще один лауреат Нобелівської премії з хімії (1981, “за розробку теорії протікання хімічних реакцій) – Роалд Гофман. Саме тоді цьому видатному інтелектуалу (хіміку, поету, драматургу, філософу), професору Корнельського університету (США), який народився у Золочеві, надали почесне звання Doctor honoris causa Львівського національного університету імені Івана Франка."
          }, {
            "id": 66,
            "period_id": 5,
            "title": "",
            "description": "У стінах Львівського університету виступали з доповідями та лекціями інтелектуали світового масштабу: норвезький письменник Юстейн Ґордер (2009), лауреат Нобелівської премії з хімії (1987, за синтез криптандів) професор Страсбурзького університету Жан-Марі Лен (2010). У 2013 р. лекцію на тему “Невелике доповнення до довгої соціальної історії часу” в Актовій залі Університету прочитав один із творців концепції постмодернізму, професор Університету Лідса Зиґмунт Бауман. У жовтні 2015 р. Львівський університет відвідав ще один лауреат Нобелівської премії з хімії (1981, “за розробку теорії протікання хімічних реакцій) – Роалд Гофман. Саме тоді цьому видатному інтелектуалу (хіміку, поету, драматургу, філософу), професору Корнельського університету (США), який народився у Золочеві, надали почесне звання Doctor honoris causa Львівського національного університету імені Івана Франка."
          }, {
            "id": 67,
            "period_id": 5,
            "title": "",
            "description": "Воля. Початок ХХІ ст. став переломним періодом новітньої історії України, в усіх ключових подіях якої Львівський університет брав активну участь. Так, упродовж листопада–грудня 2004 р. його студенти та працівники були учасниками Помаранчевої революції, відстоюючи громадянські права та свободи на Майдані у Києві. У ті дні І. Вакарчуком започаткувано акції “Нас не роз’єднати” та “Різдво разом”, покликані сприяти єдності українського суспільства."
          }, {
            "id": 68,
            "period_id": 5,
            "title": "",
            "description": "Героїзм і самопожертву студенти та працівники Львівського університету продемонстрували й під час Революції Гідності. У листопаді 2013 р. вони були учасниками віч на підтримку євроінтеграції України у Львові та Києві, у грудні – “маршів мільйонів” у Києві, упродовж усієї революції перебували на Майдані. Вчена рада Університету на чолі з в. о. ректора Василем Височанським неодноразово зверталася до Президента з вимогою відправити уряд у відставку й підписати Угоду про асоціацію з Європейським Союзом. Львівський університет рішуче реагував на загострення суспільно-політичної ситуації в Україні. 19 лютого 2014 р. в Університеті створено Комітет національного спротиву (страйковий комітет), який очолив голова профспілки працівників Володимир Качмар, заступниками обрано студентів Андрія Ткачука, Анастасію Сохацьку та тодішнього голову студентської профспілки Михайла Мураля. До складу комітету увійшли також відповідальні особи від факультетів та підрозділів.\n" +
              "20 лютого 2014 р. на вул. Інститутській загинули герої Небесної сотні Ігор Костенко (студент географічного факультету, народився 31 грудня 1991 р. у с. Зубрець Бучацького р-ну Тернопільської обл.), Богдан Сольчаник (випускник історичного факультету, народився 25 липня 1985 р. у Старому Самборі), Сергій Кемський (випускник філософського факультету, народився 15 листопада 1981 р. у Керчі). 13 березня 2014 р. від ножового поранення загинув магістрант економічного факультету Дмитро Чернявський (народився 5 березня 1992 р. у селищі Хромове Донецької обл.): як доброволець самооборони, він охороняв мітинг за єдність України в Донецьку, на учасників якого напала група озброєних проросійських сепаратистів."
          }, {
            "id": 69,
            "period_id": 5,
            "title": "",
            "description": "Викладачі та студенти Львівського університету залучені до збору спогадів учасників Революції Гідності та російсько-української війни. У рамках проекту “Майдан: усна історія”, започаткованим Українським інститутом національної пам’яті та Фондом збереження історії Майдану, координацію записів здійснюють викладачі та студенти кафедри новітньої історії України імені Михайла Грушевського. З ініціативи Відділу інформаційного забезпечення Львівського національного університету імені Івана Франка розпочато проект “Університет і війна”, метою якого є збір та публікація інтерв’ю зі студентами, викладачами та працівниками Університету – безпосередніми учасниками російсько-української війни."
          }, {
            "id": 67,
            "period_id": 5,
            "title": "",
            "description": "У 2014 р. у своїй інавгураційній промові ректор Львівського національного університету імені Івана Франка Володимир Мельник відзначив: “Львівський університет імені Івана Франка за своїм метафізичним статусом, неосяжний для тілесного ока і непідвладний догматичному розуму, в українському культурному просторі займає особливе місце. Він є символом і зосередженням потуги наукового раціоналізму, центром притягання для людей (особливо молодих), які прагнуть безкорисливо служити Істині, осередком здобуття фундаментальних наукових знань і водночас Університет є джерелом невмирущого національного духу”. Ці слова, які звучать в унісон Франковим “Дух, наука, думка, воля”, є виразом квінтесенції ідеї Львівського університету."
          }
          ]
        );
      }
    );
  },

  down(queryInterface) {
    return queryInterface.dropTable("event");
  }
};
